Documents/гф_ВводНачальныхОстатковКМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_ВводНачальныхОстатковКМ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковокТоваров</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеШтрихкода</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/гф_ВводНачальныхОстатковКМ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Перед("ПриЗаписи")
Процедура гф_ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеЗагрузки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ДанныеЗагрузки.GTIN КАК GTIN,
	|	ДанныеЗагрузки.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ ДанныеЗагрузки
	|ИЗ
	|	&ДанныеЗагрузки КАК ДанныеЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗагрузки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ДанныеЗагрузки.НомерГТД КАК НомерГТД,
	|	ДанныеЗагрузки.GTIN КАК GTIN
	|ПОМЕСТИТЬ ДанныеДляГенерацииКМ
	|ИЗ
	|	ДанныеЗагрузки КАК ДанныеЗагрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО ДанныеЗагрузки.ЗначениеШтрихкода = ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,
	|	ДанныеДляГенерацииКМ.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ЕСТЬNULL(НомераГТД.Ссылка, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК гф_НомерГТД
	|ИЗ
	|	ДанныеДляГенерацииКМ КАК ДанныеДляГенерацииКМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ДанныеДляГенерацииКМ.GTIN = ШтрихкодыНоменклатуры.Штрихкод
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ДанныеДляГенерацииКМ.НомерГТД = НомераГТД.Код";
	ДанныеЗагрузки = ШтрихкодыУпаковокТоваров.Выгрузить();
	Запрос.УстановитьПараметр("ДанныеЗагрузки", ДанныеЗагрузки);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ШК = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		// ЗначениеШтрихкода, Номенклатура, Характеристика, Упаковка, гф_НомерГТД
		ЗаполнитьЗначенияСвойств(ШК, Выборка);
		ШК.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
		ШК.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ШК.Количество = 1;
		//ШК.КоличествоПотребительскихУпаковок =1;
		ШК.гф_ЗначениеШтрихкодаBase64 = ШтрихкодированиеИСКлиентСервер.ШтрихкодВBase64(ШК.ЗначениеШтрихкода);
		ШК.гф_Комментарий = "Создан документом " + Ссылка;
		ШК.Ответственный = Пользователи.АвторизованныйПользователь();
		Попытка
			ШК.Записать();
		Исключение
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Ошибка создания элемента справочника " + 
			"""Штрихкоды упаковок товаров"" (" + Выборка["ЗначениеШтрихкода"] + ")");
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура гф_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЭтоНовый() Тогда
		Ответственный = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
